<a href="https://colab.research.google.com/github/louispaulet/pattern_mining_course/blob/main/PMSNA_HW1_v2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This version contains explanations about each and every step between the inital parsing of the data to the final result. There is no unique minepi() function here, rather a series of inputs and ouputs.

In [ ]:
import pandas as pd
df = pd.read_csv('YahooFinance.data', sep='	')
df

       ID_Sequence  ID_Time            Cotation
0                1        1         Microsoft=3
1                1        1            Boeing=0
2                1        1         Citigroup=3
3                1        1           Du_Pont=0
4                1        1      Exxon_Mobil=-2
...            ...      ...                 ...
18818            1     1255  American_Express=0
18819            1     1255              AT&T=0
18820            1     1255  Procter_&_Gamble=0
18821            1     1255           Verizon=0
18822            1     1255      Morgan_Chase=0

[18823 rows x 3 columns]

In [ ]:
#the "ID_Sequence" column only contains the value "1" so we drop it

df = df.drop("ID_Sequence", axis=1)
df

       ID_Time            Cotation
0            1         Microsoft=3
1            1            Boeing=0
2            1         Citigroup=3
3            1           Du_Pont=0
4            1      Exxon_Mobil=-2
...        ...                 ...
18818     1255  American_Express=0
18819     1255              AT&T=0
18820     1255  Procter_&_Gamble=0
18821     1255           Verizon=0
18822     1255      Morgan_Chase=0

[18823 rows x 2 columns]

In [ ]:
#true cardinality of the event names
event_names = df.Cotation.unique().tolist()
event_names

['Microsoft=3',
 'Boeing=0',
 'Citigroup=3',
 'Du_Pont=0',
 'Exxon_Mobil=-2',
 'HP=3',
 'Coca_Cola=-1',
 'General_Motors=3',
 'Intel=3',
 'Altria=-3',
 'American_Express=3',
 'AT&T=1',
 'Procter_&_Gamble=-2',
 'Verizon=3',
 'Morgan_Chase=3',
 'Microsoft=1',
 'Boeing=-1',
 'Citigroup=1',
 'Du_Pont=1',
 'Exxon_Mobil=-1',
 'HP=1',
 'General_Motors=2',
 'Intel=-1',
 'Altria=-2',
 'American_Express=-2',
 'Verizon=1',
 'Morgan_Chase=1',
 'Boeing=-2',
 'Citigroup=-2',
 'Du_Pont=-1',
 'Exxon_Mobil=0',
 'HP=-3',
 'Coca_Cola=0',
 'General_Motors=-3',
 'Intel=-3',
 'Altria=0',
 'AT&T=-2',
 'Procter_&_Gamble=2',
 'Verizon=0',
 'Morgan_Chase=-3',
 'Microsoft=0',
 'Citigroup=0',
 'Coca_Cola=1',
 'General_Motors=-1',
 'Intel=0',
 'Altria=2',
 'American_Express=-3',
 'AT&T=0',
 'Procter_&_Gamble=1',
 'Morgan_Chase=0',
 'Citigroup=-1',
 'Du_Pont=-2',
 'HP=0',
 'AT&T=2',
 'Procter_&_Gamble=-1',
 'Morgan_Chase=-1',
 'Boeing=1',
 'Citigroup=2',
 'Intel=1',
 'Altria=1',
 'American_Express=0',
 'Morgan_Chase=2',
 'Microsoft=2',
 'General_Motors=0',
 'American_Express=1',
 'Microsoft=-1',
 'Exxon_Mobil=1',
 'Intel=-2',
 'AT&T=-1',
 'Du_Pont=2',
 'HP=-1',
 'Verizon=-1',
 'HP=2',
 'General_Motors=1',
 'Procter_&_Gamble=0',
 'Verizon=2',
 'Intel=2',
 'American_Express=-1',
 'HP=-2',
 'American_Express=2',
 'Verizon=-2',
 'Boeing=2',
 'Altria=-1',
 'Du_Pont=3',
 'Procter_&_Gamble=3',
 'Microsoft=-2',
 'General_Motors=-2',
 'Verizon=-3',
 'Morgan_Chase=-2',
 'Microsoft=-3',
 'Citigroup=-3',
 'Coca_Cola=-3',
 'Coca_Cola=-2',
 'Procter_&_Gamble=-3',
 'AT&T=-3',
 'Boeing=-3',
 'Exxon_Mobil=2',
 'Coca_Cola=2',
 'AT&T=3',
 'Boeing=3',
 'Altria=3',
 'Coca_Cola=3',
 'Du_Pont=-3',
 'Exxon_Mobil=3',
 'Exxon_Mobil=-3']

An id-list is a list of all sequences that contain the event. We must create an id_list for every event_name

In [ ]:
id_lists = []
for event_name in event_names:
  id_lists.append((event_name, df[df.Cotation == event_name].ID_Time.tolist()))


len(id_lists)

105

For the next step, we create a second list of id_lists that doesn't contains the "0" variations (exclude the lack of variation).

In [ ]:
import re

zeroless_id_list = []

for id_list in id_lists:

  #exclude all values that contain "=0" string
  match = re.search("^.*(\=0)", id_list[0])

  if not match:
    zeroless_id_list.append(id_list)


# we can see that we removed 15 event_types from the id_lists,
# wich corresponds to the number of company names analysed
len(id_lists) , len(zeroless_id_list)

(105, 90)

We are only interested in frequent events with a frequency >= 50

In [ ]:
frequent_id_list = []

for zeroless_id in zeroless_id_list:
  if len(zeroless_id[1]) >= 50:
    frequent_id_list.append(zeroless_id)

#compare the difference between frequent events and non-frequent
print(len(zeroless_id_list), len(frequent_id_list))

90 44

We want to have a size of events of 2 so we must merge event_types with sequences that have a gap below to min_gap constraint

In [ ]:
from itertools import permutations

#gather cardinality of frequent event_types
card_event_types = []
for frequent_id in frequent_id_list:
  card_event_types.append(frequent_id[0])

#list all pairs of even_types
pairs_event_types = list(permutations(card_event_types, 2))

#how many permutations of events (sequences) do we have ?
len(pairs_event_types)

1892

We build a dataframe that contains the permutations, the cardinalities, their head_frequencies, confidence, and recall

In [ ]:
df_event_types = pd.DataFrame(columns=["Xn", "Yn", "XYhead", "frequency", "confidence", "recall", "Xseq", "Yseq", "XYjoinSeq", "L", "hMeanConfRec"])
df_event_typesXY = pd.DataFrame(pairs_event_types, columns=["X", "Y"])
df_event_types = pd.concat([df_event_typesXY, df_event_types], axis=1)

df_event_types

                    X                   Y   Xn  ... XYjoinSeq    L hMeanConfRec
0        Coca_Cola=-1             Intel=3  NaN  ...       NaN  NaN          NaN
1        Coca_Cola=-1              AT&T=1  NaN  ...       NaN  NaN          NaN
2        Coca_Cola=-1         Microsoft=1  NaN  ...       NaN  NaN          NaN
3        Coca_Cola=-1           Boeing=-1  NaN  ...       NaN  NaN          NaN
4        Coca_Cola=-1         Citigroup=1  NaN  ...       NaN  NaN          NaN
...               ...                 ...  ...  ...       ...  ...          ...
1887  Morgan_Chase=-2               HP=-2  NaN  ...       NaN  NaN          NaN
1888  Morgan_Chase=-2  American_Express=2  NaN  ...       NaN  NaN          NaN
1889  Morgan_Chase=-2            Boeing=2  NaN  ...       NaN  NaN          NaN
1890  Morgan_Chase=-2           Altria=-1  NaN  ...       NaN  NaN          NaN
1891  Morgan_Chase=-2   General_Motors=-2  NaN  ...       NaN  NaN          NaN

[1892 rows x 13 columns]

Then we add the cardinalities to the columns (as well as sequences for later)

In [ ]:
for frequent_id in frequent_id_list:
  df_event_types.loc[df_event_types.X == frequent_id[0], "Xn"] = len(frequent_id[1])
  df_event_types.loc[df_event_types.X == frequent_id[0], "Xseq"] = [frequent_id[1]]

  df_event_types.loc[df_event_types.Y == frequent_id[0], "Yn"] = len(frequent_id[1])
  df_event_types.loc[df_event_types.Y == frequent_id[0], "Yseq"] = [frequent_id[1]]

df_event_types

                    X                   Y   Xn  ... XYjoinSeq    L hMeanConfRec
0        Coca_Cola=-1             Intel=3  184  ...       NaN  NaN          NaN
1        Coca_Cola=-1              AT&T=1  184  ...       NaN  NaN          NaN
2        Coca_Cola=-1         Microsoft=1  184  ...       NaN  NaN          NaN
3        Coca_Cola=-1           Boeing=-1  184  ...       NaN  NaN          NaN
4        Coca_Cola=-1         Citigroup=1  184  ...       NaN  NaN          NaN
...               ...                 ...  ...  ...       ...  ...          ...
1887  Morgan_Chase=-2               HP=-2   57  ...       NaN  NaN          NaN
1888  Morgan_Chase=-2  American_Express=2   57  ...       NaN  NaN          NaN
1889  Morgan_Chase=-2            Boeing=2   57  ...       NaN  NaN          NaN
1890  Morgan_Chase=-2           Altria=-1   57  ...       NaN  NaN          NaN
1891  Morgan_Chase=-2   General_Motors=-2   57  ...       NaN  NaN          NaN

[1892 rows x 13 columns]

We need to join Xseq and Yseq into XYjoinSeq with maxSpan param(we consider minGap = 1 and maxSpan = 2).

In [ ]:
def joinSeqs(Xseq, Yseq, maxSpan, minGap):
  joinSeq = []
  for Xseq_occurence in Xseq:
    for Yseq_occurrence in Yseq:
      #we want to perform a forward-join of at least Xseq_occurence+minGap
      if (Xseq_occurence + minGap > Yseq_occurrence):
        #case where the Xseq_occurrence is too low
        None;
      #we want to add the number to the join sequence if the maxSpan is respected
      elif (Yseq_occurrence - Xseq_occurence <= maxSpan):
        joinSeq.append((Xseq_occurence, Yseq_occurrence))
      else:
        #else we finished with this Xseq_occurrence and go to the next one
        break;
  return joinSeq

#test
test_x_seq = [1, 3, 4]
test_y_seq = [2, 3, 6]
maxSpan = 2
minGap = 1

joinSeqs(test_x_seq, test_y_seq, maxSpan, minGap)

[(1, 2), (1, 3), (4, 6)]

Apply the join between Xseq and Yseq in the dataframe to obtain XYjoinSeq

In [ ]:
maxSpan = 2
minGap = 1

df_event_types['XYjoinSeq'] = df_event_types.apply(lambda row: joinSeqs(row.Xseq, row.Yseq, maxSpan, minGap), axis=1)
df_event_types

                    X                   Y  ...    L hMeanConfRec
0        Coca_Cola=-1             Intel=3  ...  NaN          NaN
1        Coca_Cola=-1              AT&T=1  ...  NaN          NaN
2        Coca_Cola=-1         Microsoft=1  ...  NaN          NaN
3        Coca_Cola=-1           Boeing=-1  ...  NaN          NaN
4        Coca_Cola=-1         Citigroup=1  ...  NaN          NaN
...               ...                 ...  ...  ...          ...
1887  Morgan_Chase=-2               HP=-2  ...  NaN          NaN
1888  Morgan_Chase=-2  American_Express=2  ...  NaN          NaN
1889  Morgan_Chase=-2            Boeing=2  ...  NaN          NaN
1890  Morgan_Chase=-2           Altria=-1  ...  NaN          NaN
1891  Morgan_Chase=-2   General_Motors=-2  ...  NaN          NaN

[1892 rows x 13 columns]

From the XYjoinSeq, we can count the number of pairs to obtain XYhead

In [ ]:
df_event_types['XYhead'] = df_event_types.apply(lambda row: len(row.XYjoinSeq), axis=1)
df_event_types

                    X                   Y  ...    L hMeanConfRec
0        Coca_Cola=-1             Intel=3  ...  NaN          NaN
1        Coca_Cola=-1              AT&T=1  ...  NaN          NaN
2        Coca_Cola=-1         Microsoft=1  ...  NaN          NaN
3        Coca_Cola=-1           Boeing=-1  ...  NaN          NaN
4        Coca_Cola=-1         Citigroup=1  ...  NaN          NaN
...               ...                 ...  ...  ...          ...
1887  Morgan_Chase=-2               HP=-2  ...  NaN          NaN
1888  Morgan_Chase=-2  American_Express=2  ...  NaN          NaN
1889  Morgan_Chase=-2            Boeing=2  ...  NaN          NaN
1890  Morgan_Chase=-2           Altria=-1  ...  NaN          NaN
1891  Morgan_Chase=-2   General_Motors=-2  ...  NaN          NaN

[1892 rows x 13 columns]

One last information needed before computing the remaining stats is the length of the sequence.

In [ ]:
#length of a sequence is first time to last time observed
def length_of_seq(seq):
  return seq[len(seq)-1][1] - seq[0][0]

df_event_types['L'] = df_event_types.apply(lambda row: length_of_seq(row.XYjoinSeq), axis=1)
df_event_types

                    X                   Y  ...     L hMeanConfRec
0        Coca_Cola=-1             Intel=3  ...   589          NaN
1        Coca_Cola=-1              AT&T=1  ...  1170          NaN
2        Coca_Cola=-1         Microsoft=1  ...  1148          NaN
3        Coca_Cola=-1           Boeing=-1  ...  1198          NaN
4        Coca_Cola=-1         Citigroup=1  ...  1170          NaN
...               ...                 ...  ...   ...          ...
1887  Morgan_Chase=-2               HP=-2  ...   624          NaN
1888  Morgan_Chase=-2  American_Express=2  ...   432          NaN
1889  Morgan_Chase=-2            Boeing=2  ...   555          NaN
1890  Morgan_Chase=-2           Altria=-1  ...   567          NaN
1891  Morgan_Chase=-2   General_Motors=-2  ...   433          NaN

[1892 rows x 13 columns]

We define the missing statistics and apply them to the dataframe

In [ ]:
def frequency(head_ab, L):
  if (L == 0):
    return None
  return head_ab / L

def confidence(head_ab, na):
  if (na == 0):
    return None
  return head_ab / na

def recall(head_ab, nb):
  if (nb == 0):
    return None
  return head_ab / nb

df_event_types['frequency'] = df_event_types.apply(lambda row: frequency(row.XYhead, row.L), axis=1)
df_event_types['confidence'] = df_event_types.apply(lambda row: confidence(row.XYhead, row.Xn), axis=1)
df_event_types['recall'] = df_event_types.apply(lambda row: recall(row.XYhead, row.Yn), axis=1)

df_event_types

                    X                   Y  ...     L hMeanConfRec
0        Coca_Cola=-1             Intel=3  ...   589          NaN
1        Coca_Cola=-1              AT&T=1  ...  1170          NaN
2        Coca_Cola=-1         Microsoft=1  ...  1148          NaN
3        Coca_Cola=-1           Boeing=-1  ...  1198          NaN
4        Coca_Cola=-1         Citigroup=1  ...  1170          NaN
...               ...                 ...  ...   ...          ...
1887  Morgan_Chase=-2               HP=-2  ...   624          NaN
1888  Morgan_Chase=-2  American_Express=2  ...   432          NaN
1889  Morgan_Chase=-2            Boeing=2  ...   555          NaN
1890  Morgan_Chase=-2           Altria=-1  ...   567          NaN
1891  Morgan_Chase=-2   General_Motors=-2  ...   433          NaN

[1892 rows x 13 columns]

We search the best tradeoff between frequency and recall.
First, we will drop the rows that have either frequency or recall set as NaN because of a division by 0.
Then, we will compute the harmonic mean between confidence and recall and select the 10 best episodes.

The answer to question 2 is the first line of the output dataframe. For efficient trading, the other rules below should also be considered.

In [ ]:
import statistics #we need the harmonic mean

df_event_types['hMeanConfRec'] = df_event_types.apply(lambda row: statistics.harmonic_mean([row.confidence, row.recall]), axis=1)
df_event_types.nlargest(10, 'hMeanConfRec')

                        X                 Y  ...     L hMeanConfRec
193             Boeing=-1          Boeing=1  ...  1241     0.537786
759     General_Motors=-1     Exxon_Mobil=1  ...  1210     0.533081
765     General_Motors=-1  General_Motors=1  ...  1245     0.525490
200             Boeing=-1     Exxon_Mobil=1  ...  1228     0.503759
1453           Verizon=-1  General_Motors=1  ...  1209     0.497976
1597  American_Express=-1         Du_Pont=1  ...  1216     0.495690
195             Boeing=-1          Altria=1  ...  1222     0.492000
1226         Microsoft=-1          Boeing=1  ...  1231     0.490566
607            Du_Pont=-1       Citigroup=1  ...  1209     0.489083
950              Boeing=1         Boeing=-1  ...  1246     0.488576

[10 rows x 13 columns]